Revit 2026 API

# ScheduleFieldId Properties

---

The ScheduleFieldId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IntegerValue | Provides the value of the ScheduleFieldId as an integer. |
|  | InvalidScheduleFieldId | Get the invalid ScheduleFieldId whose IntegerValue is -1. |

#### Reference

ScheduleFieldId Class

Autodesk.Revit.DB Namespace